peterm2024/seniorenuhr/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-LCD-7: 8 MB Flash (N8R8!), 8 MB Octal-PSRAM
# Achtung: die Produktseite nennt 16 MB, verbaut ist aber ein 8-MB-Chip
# (per "esptool flash_id" verifiziert: GigaDevice, 8MB, Quad)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Code/Konstanten auch aus PSRAM ausfuehrbar -> weniger Flash-Zugriffe,
# verhindert Flackern des RGB-Displays bei WLAN-/Flash-Aktivitaet
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# RGB-Panel: Interrupts auch waehrend Flash-Schreibzugriffen bedienen
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# HTTPS-Kalenderabruf: Zertifikatsbuendel fuer die TLS-Pruefung von
# calendar.google.com
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
